Autodesk.Revit.DB.ImageInstance.IsValidView(Autodesk.Revit.DB.View)
Check that the view is a valid view for ImageInstance elements
view:
The view to validate
Returns:
True if the view can contain ImageInstance elements.  False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageInstance.SetLocation(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoxPlacement)
Moves the ImageInstance to the specified location
newLocation:
The new location of the specified point
placementPoint:
The placementPoint specifies which point of the ImageInstance should be placed at the given location.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given newLocation is more than 10 miles from the origin of the model
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImageInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ImagePlacementOptions)
Creates a new ImageInstance element placed in a view.
document:
The document.
view:
The view in which the image will be placed.
imageTypeId:
The id of the Autodesk.Revit.DB.ImageType element for this ImageInstance.
placementOptions:
Options that specify where the ImageInstance should be placed.
Returns:
The new ImageInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given view cannot contain ImageInstance elements
-or-
The given imageTypeId can not be used as a ImageType for ImageInstance elements
-or-
The given placementOptions specify a location that is more than 10 miles from the origin of the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020